/**
 * @file 4.3最小路径和.cpp
 * @author your name (you@domain.com)
 * @brief 
 * @version 0.1
 * @date 2022-06-29
 * 
 * @copyright Copyright (c) 2022
 * 
 */

/**
 * @brief 给你一个二维数组matrix,其中每个数都是正数，要求从左上角走到右下角，每一步只能向右或者向下。
 * 沿途经过的数字要累加起来。返回最小的路径和。
 * 
 */
#include <vector>
using namespace std;

/**
 * @brief 空间压缩技巧
 * 当一个动态规划二维表普遍位置只依赖左边和上边时，二维表可以压缩成一个数组。自我更新。
 *          依赖左上边多个值，从右往左更新
 * 
 * 假设一张表 1000000 * 4，只需要一行的空间，即4个，往下更新1000000次
 *           4 * 1000000，只需要一列的空间，即4个，往右更新1000000次
 *         
 * 
 */